let a
a = prompt( ' введи ' )
    switch(a){
        case '1':
            alert(' Январь ')
            alert(' тип: зима ')
            alert(' сколько дней в месяце: 31 ')
        break;
        case '2':
            alert(' месяц: Февраль ')
            alert(' тип: зима ')
            alert(' сколько дней в месяце: 28-29(взависимости от высокостный год или нет) ')
        break;
        case '3':
            alert(' месяц: Март ')
            alert(' тип: весна ')
            alert(' сколько дней в месяце: 31 ')
        break;
        case '4':
            alert(' месяц: Апрель ')
            alert(' тип: весна ')
            alert(' сколько дней в месяце: 30 ')
        break;
        case '5':
            alert(' месяц: Май ')
            alert(' тип: весна ')
            alert(' сколько дней в месяце: 31 ')
        break;
        case '6':
            alert(' месяц: Июнь ')
            alert(' тип: лето ')
            alert(' сколько дней в месяце: 30 ')
        break;
        case '7':
            alert(' месяц: Июль ')
            alert(' тип: лето ')
            alert(' сколько дней в месяце: 31 ')
        break;
        case '8':
            alert(' месяц: Август ')
            alert(' тип: лето ')
            alert(' сколько дней в месяце: 31 ')
        break;
        case '9':
            alert(' месяц: Сентябрь ')
            alert(' тип: осень ')
            alert(' сколько дней в месяце: 30 ')
        break;
        case '10':
            alert(' месяц: Октябрь ')
            alert(' тип: осень ')
            alert(' сколько дней в месяце: 31 ')
        break;
        case '11':
            alert(' месяц: Ноябрь ')
            alert(' тип: осень')
            alert(' сколько дней в месяце: 30')
        break;
        case '12':
            alert(' месяц: Декабрь ')
            alert(' тип: зима ')
            alert(' сколько дней в месяце: 31 ')
        break;
        default:
            alert( 'Неизвестное значение' );
    }

